weifengdq/embedded/tc364/0_Board_Test_CAN0/Libraries/Infra/Sfr/TC36x/IfxPms_bf.h
/** \brief Length for Ifx_PMS_OVMON2_Bits.PREOVVAL */
#define IFX_PMS_OVMON2_PREOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_OVMON2_Bits.PREOVVAL */
#define IFX_PMS_OVMON2_PREOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OVMON2_Bits.PREOVVAL */
#define IFX_PMS_OVMON2_PREOVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_OVMON2_Bits.VDDMOVVAL */
#define IFX_PMS_OVMON2_VDDMOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_OVMON2_Bits.VDDMOVVAL */
#define IFX_PMS_OVMON2_VDDMOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OVMON2_Bits.VDDMOVVAL */
#define IFX_PMS_OVMON2_VDDMOVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_OVMON2_Bits.SBOVVAL */
#define IFX_PMS_OVMON2_SBOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_OVMON2_Bits.SBOVVAL */
#define IFX_PMS_OVMON2_SBOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_OVMON2_Bits.SBOVVAL */
#define IFX_PMS_OVMON2_SBOVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_OVMON2_Bits.SLCK */
#define IFX_PMS_OVMON2_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_OVMON2_Bits.SLCK */
#define IFX_PMS_OVMON2_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_OVMON2_Bits.SLCK */
#define IFX_PMS_OVMON2_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_HSMUVMON_Bits.EVRCUVVAL */
#define IFX_PMS_HSMUVMON_EVRCUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_HSMUVMON_Bits.EVRCUVVAL */
#define IFX_PMS_HSMUVMON_EVRCUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_HSMUVMON_Bits.EVRCUVVAL */
#define IFX_PMS_HSMUVMON_EVRCUVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_HSMUVMON_Bits.EVR33UVVAL */
#define IFX_PMS_HSMUVMON_EVR33UVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_HSMUVMON_Bits.EVR33UVVAL */
#define IFX_PMS_HSMUVMON_EVR33UVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_HSMUVMON_Bits.EVR33UVVAL */
#define IFX_PMS_HSMUVMON_EVR33UVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_HSMUVMON_Bits.SWDUVVAL */
#define IFX_PMS_HSMUVMON_SWDUVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_HSMUVMON_Bits.SWDUVVAL */
#define IFX_PMS_HSMUVMON_SWDUVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_HSMUVMON_Bits.SWDUVVAL */
#define IFX_PMS_HSMUVMON_SWDUVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_HSMUVMON_Bits.EVRCOFF */
#define IFX_PMS_HSMUVMON_EVRCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_HSMUVMON_Bits.EVRCOFF */
#define IFX_PMS_HSMUVMON_EVRCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_HSMUVMON_Bits.EVRCOFF */
#define IFX_PMS_HSMUVMON_EVRCOFF_OFF (24u)

/** \brief Length for Ifx_PMS_HSMUVMON_Bits.EVR33OFF */
#define IFX_PMS_HSMUVMON_EVR33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_HSMUVMON_Bits.EVR33OFF */
#define IFX_PMS_HSMUVMON_EVR33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_HSMUVMON_Bits.EVR33OFF */
#define IFX_PMS_HSMUVMON_EVR33OFF_OFF (25u)

/** \brief Length for Ifx_PMS_HSMUVMON_Bits.SWDOFF */
#define IFX_PMS_HSMUVMON_SWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_HSMUVMON_Bits.SWDOFF */
#define IFX_PMS_HSMUVMON_SWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_HSMUVMON_Bits.SWDOFF */
#define IFX_PMS_HSMUVMON_SWDOFF_OFF (26u)

/** \brief Length for Ifx_PMS_HSMUVMON_Bits.HSMFIL */
#define IFX_PMS_HSMUVMON_HSMFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_HSMUVMON_Bits.HSMFIL */
#define IFX_PMS_HSMUVMON_HSMFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_HSMUVMON_Bits.HSMFIL */
#define IFX_PMS_HSMUVMON_HSMFIL_OFF (27u)

/** \brief Length for Ifx_PMS_HSMUVMON_Bits.SLCK */
#define IFX_PMS_HSMUVMON_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_HSMUVMON_Bits.SLCK */
#define IFX_PMS_HSMUVMON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_HSMUVMON_Bits.SLCK */
#define IFX_PMS_HSMUVMON_SLCK_OFF (31u)

/** \brief Length for Ifx_PMS_HSMOVMON_Bits.EVRCOVVAL */
#define IFX_PMS_HSMOVMON_EVRCOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_HSMOVMON_Bits.EVRCOVVAL */
#define IFX_PMS_HSMOVMON_EVRCOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_HSMOVMON_Bits.EVRCOVVAL */
#define IFX_PMS_HSMOVMON_EVRCOVVAL_OFF (0u)

/** \brief Length for Ifx_PMS_HSMOVMON_Bits.EVR33OVVAL */
#define IFX_PMS_HSMOVMON_EVR33OVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_HSMOVMON_Bits.EVR33OVVAL */
#define IFX_PMS_HSMOVMON_EVR33OVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_HSMOVMON_Bits.EVR33OVVAL */
#define IFX_PMS_HSMOVMON_EVR33OVVAL_OFF (8u)

/** \brief Length for Ifx_PMS_HSMOVMON_Bits.SWDOVVAL */
#define IFX_PMS_HSMOVMON_SWDOVVAL_LEN (8u)

/** \brief Mask for Ifx_PMS_HSMOVMON_Bits.SWDOVVAL */
#define IFX_PMS_HSMOVMON_SWDOVVAL_MSK (0xffu)

/** \brief Offset for Ifx_PMS_HSMOVMON_Bits.SWDOVVAL */
#define IFX_PMS_HSMOVMON_SWDOVVAL_OFF (16u)

/** \brief Length for Ifx_PMS_HSMOVMON_Bits.EVRCOFF */
#define IFX_PMS_HSMOVMON_EVRCOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_HSMOVMON_Bits.EVRCOFF */
#define IFX_PMS_HSMOVMON_EVRCOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_HSMOVMON_Bits.EVRCOFF */
#define IFX_PMS_HSMOVMON_EVRCOFF_OFF (24u)

/** \brief Length for Ifx_PMS_HSMOVMON_Bits.EVR33OFF */
#define IFX_PMS_HSMOVMON_EVR33OFF_LEN (1u)

/** \brief Mask for Ifx_PMS_HSMOVMON_Bits.EVR33OFF */
#define IFX_PMS_HSMOVMON_EVR33OFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_HSMOVMON_Bits.EVR33OFF */
#define IFX_PMS_HSMOVMON_EVR33OFF_OFF (25u)

/** \brief Length for Ifx_PMS_HSMOVMON_Bits.SWDOFF */
#define IFX_PMS_HSMOVMON_SWDOFF_LEN (1u)

/** \brief Mask for Ifx_PMS_HSMOVMON_Bits.SWDOFF */
#define IFX_PMS_HSMOVMON_SWDOFF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_HSMOVMON_Bits.SWDOFF */
#define IFX_PMS_HSMOVMON_SWDOFF_OFF (26u)

/** \brief Length for Ifx_PMS_HSMOVMON_Bits.SLCK */
#define IFX_PMS_HSMOVMON_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_HSMOVMON_Bits.SLCK */
#define IFX_PMS_HSMOVMON_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_HSMOVMON_Bits.SLCK */
#define IFX_PMS_HSMOVMON_SLCK_OFF (31u)

/** \brief Length for Ifx_PMS_EVR33CON_Bits.SHVH33 */
#define IFX_PMS_EVR33CON_SHVH33_LEN (8u)

/** \brief Mask for Ifx_PMS_EVR33CON_Bits.SHVH33 */
#define IFX_PMS_EVR33CON_SHVH33_MSK (0xffu)

/** \brief Offset for Ifx_PMS_EVR33CON_Bits.SHVH33 */
#define IFX_PMS_EVR33CON_SHVH33_OFF (0u)

/** \brief Length for Ifx_PMS_EVR33CON_Bits.SHHVEN */
#define IFX_PMS_EVR33CON_SHHVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR33CON_Bits.SHHVEN */
#define IFX_PMS_EVR33CON_SHHVEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_EVR33CON_Bits.SHHVEN */
#define IFX_PMS_EVR33CON_SHHVEN_OFF (12u)

/** \brief Length for Ifx_PMS_EVR33CON_Bits.SHLVEN */
#define IFX_PMS_EVR33CON_SHLVEN_LEN (1u)

/** \brief Mask for Ifx_PMS_EVR33CON_Bits.SHLVEN */
#define IFX_PMS_EVR33CON_SHLVEN_MSK (0x1u)

