weifengdq/embedded/tc364/0_Board_Test_CAN0/Libraries/Infra/Sfr/TC36x/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.ESR1WKEN */
#define IFX_PMS_PMSWCR0_ESR1WKEN_OFF (25u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINAWKEN */
#define IFX_PMS_PMSWCR0_PINAWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINAWKEN */
#define IFX_PMS_PMSWCR0_PINAWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINAWKEN */
#define IFX_PMS_PMSWCR0_PINAWKEN_OFF (26u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PINBWKEN */
#define IFX_PMS_PMSWCR0_PINBWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PINBWKEN */
#define IFX_PMS_PMSWCR0_PINBWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PINBWKEN */
#define IFX_PMS_PMSWCR0_PINBWKEN_OFF (27u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PWRWKEN */
#define IFX_PMS_PMSWCR0_PWRWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PWRWKEN */
#define IFX_PMS_PMSWCR0_PWRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PWRWKEN */
#define IFX_PMS_PMSWCR0_PWRWKEN_OFF (28u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.SCRWKEN */
#define IFX_PMS_PMSWCR0_SCRWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.SCRWKEN */
#define IFX_PMS_PMSWCR0_SCRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.SCRWKEN */
#define IFX_PMS_PMSWCR0_SCRWKEN_OFF (29u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.PORSTWKEN */
#define IFX_PMS_PMSWCR0_PORSTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.PORSTWKEN */
#define IFX_PMS_PMSWCR0_PORSTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.PORSTWKEN */
#define IFX_PMS_PMSWCR0_PORSTWKEN_OFF (30u)

/** \brief Length for Ifx_PMS_PMSWCR0_Bits.WUTWKEN */
#define IFX_PMS_PMSWCR0_WUTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR0_Bits.WUTWKEN */
#define IFX_PMS_PMSWCR0_WUTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR0_Bits.WUTWKEN */
#define IFX_PMS_PMSWCR0_WUTWKEN_OFF (31u)

/** \brief Length for Ifx_PMS_PMSWCR2_Bits.SCRINT */
#define IFX_PMS_PMSWCR2_SCRINT_LEN (8u)

/** \brief Mask for Ifx_PMS_PMSWCR2_Bits.SCRINT */
#define IFX_PMS_PMSWCR2_SCRINT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_PMSWCR2_Bits.SCRINT */
#define IFX_PMS_PMSWCR2_SCRINT_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWCR2_Bits.SCRECC */
#define IFX_PMS_PMSWCR2_SCRECC_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR2_Bits.SCRECC */
#define IFX_PMS_PMSWCR2_SCRECC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR2_Bits.SCRECC */
#define IFX_PMS_PMSWCR2_SCRECC_OFF (9u)

/** \brief Length for Ifx_PMS_PMSWCR2_Bits.SCRWDT */
#define IFX_PMS_PMSWCR2_SCRWDT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR2_Bits.SCRWDT */
#define IFX_PMS_PMSWCR2_SCRWDT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR2_Bits.SCRWDT */
#define IFX_PMS_PMSWCR2_SCRWDT_OFF (10u)

/** \brief Length for Ifx_PMS_PMSWCR2_Bits.SCRRST */
#define IFX_PMS_PMSWCR2_SCRRST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR2_Bits.SCRRST */
#define IFX_PMS_PMSWCR2_SCRRST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR2_Bits.SCRRST */
#define IFX_PMS_PMSWCR2_SCRRST_OFF (11u)

/** \brief Length for Ifx_PMS_PMSWCR2_Bits.TCINT */
#define IFX_PMS_PMSWCR2_TCINT_LEN (8u)

/** \brief Mask for Ifx_PMS_PMSWCR2_Bits.TCINT */
#define IFX_PMS_PMSWCR2_TCINT_MSK (0xffu)

/** \brief Offset for Ifx_PMS_PMSWCR2_Bits.TCINT */
#define IFX_PMS_PMSWCR2_TCINT_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWCR2_Bits.TCINTREQ */
#define IFX_PMS_PMSWCR2_TCINTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR2_Bits.TCINTREQ */
#define IFX_PMS_PMSWCR2_TCINTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR2_Bits.TCINTREQ */
#define IFX_PMS_PMSWCR2_TCINTREQ_OFF (24u)

/** \brief Length for Ifx_PMS_PMSWCR2_Bits.SMURST */
#define IFX_PMS_PMSWCR2_SMURST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR2_Bits.SMURST */
#define IFX_PMS_PMSWCR2_SMURST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR2_Bits.SMURST */
#define IFX_PMS_PMSWCR2_SMURST_OFF (25u)

/** \brief Length for Ifx_PMS_PMSWCR2_Bits.RST */
#define IFX_PMS_PMSWCR2_RST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR2_Bits.RST */
#define IFX_PMS_PMSWCR2_RST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR2_Bits.RST */
#define IFX_PMS_PMSWCR2_RST_OFF (26u)

/** \brief Length for Ifx_PMS_PMSWCR3_Bits.WUTREL */
#define IFX_PMS_PMSWCR3_WUTREL_LEN (24u)

/** \brief Mask for Ifx_PMS_PMSWCR3_Bits.WUTREL */
#define IFX_PMS_PMSWCR3_WUTREL_MSK (0xffffffu)

/** \brief Offset for Ifx_PMS_PMSWCR3_Bits.WUTREL */
#define IFX_PMS_PMSWCR3_WUTREL_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWCR3_Bits.WUTEN */
#define IFX_PMS_PMSWCR3_WUTEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR3_Bits.WUTEN */
#define IFX_PMS_PMSWCR3_WUTEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR3_Bits.WUTEN */
#define IFX_PMS_PMSWCR3_WUTEN_OFF (27u)

/** \brief Length for Ifx_PMS_PMSWCR3_Bits.BUSY */
#define IFX_PMS_PMSWCR3_BUSY_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR3_Bits.BUSY */
#define IFX_PMS_PMSWCR3_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR3_Bits.BUSY */
#define IFX_PMS_PMSWCR3_BUSY_OFF (28u)

/** \brief Length for Ifx_PMS_PMSWCR3_Bits.WUTDIV */
#define IFX_PMS_PMSWCR3_WUTDIV_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR3_Bits.WUTDIV */
#define IFX_PMS_PMSWCR3_WUTDIV_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR3_Bits.WUTDIV */
#define IFX_PMS_PMSWCR3_WUTDIV_OFF (29u)

/** \brief Length for Ifx_PMS_PMSWCR3_Bits.WUTMODE */
#define IFX_PMS_PMSWCR3_WUTMODE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR3_Bits.WUTMODE */
#define IFX_PMS_PMSWCR3_WUTMODE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR3_Bits.WUTMODE */
#define IFX_PMS_PMSWCR3_WUTMODE_OFF (30u)

/** \brief Length for Ifx_PMS_PMSWCR4_Bits.BPSCRSTREQ */
#define IFX_PMS_PMSWCR4_BPSCRSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR4_Bits.BPSCRSTREQ */
#define IFX_PMS_PMSWCR4_BPSCRSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR4_Bits.BPSCRSTREQ */
#define IFX_PMS_PMSWCR4_BPSCRSTREQ_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWCR4_Bits.SCRSTREQ */
#define IFX_PMS_PMSWCR4_SCRSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR4_Bits.SCRSTREQ */
#define IFX_PMS_PMSWCR4_SCRSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR4_Bits.SCRSTREQ */
#define IFX_PMS_PMSWCR4_SCRSTREQ_OFF (1u)

/** \brief Length for Ifx_PMS_PMSWCR4_Bits.BPPORSTREQ */
#define IFX_PMS_PMSWCR4_BPPORSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR4_Bits.BPPORSTREQ */
#define IFX_PMS_PMSWCR4_BPPORSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR4_Bits.BPPORSTREQ */
#define IFX_PMS_PMSWCR4_BPPORSTREQ_OFF (4u)

