weifengdq/embedded/tc364/0_Board_Test_CAN0/Libraries/Infra/Sfr/TC36x/IfxPms_bf.h
/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.WUTOVRUN */
#define IFX_PMS_PMSWSTAT2_WUTOVRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.WUTOVRUN */
#define IFX_PMS_PMSWSTAT2_WUTOVRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.WUTOVRUN */
#define IFX_PMS_PMSWSTAT2_WUTOVRUN_OFF (15u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.STBYRAM */
#define IFX_PMS_PMSWSTAT2_STBYRAM_LEN (3u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.STBYRAM */
#define IFX_PMS_PMSWSTAT2_STBYRAM_MSK (0x7u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.STBYRAM */
#define IFX_PMS_PMSWSTAT2_STBYRAM_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWSTAT2_VEXTSTBYEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWSTAT2_VEXTSTBYEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.VEXTSTBYEN */
#define IFX_PMS_PMSWSTAT2_VEXTSTBYEN_OFF (19u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.BLNKFIL */
#define IFX_PMS_PMSWSTAT2_BLNKFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.BLNKFIL */
#define IFX_PMS_PMSWSTAT2_BLNKFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.BLNKFIL */
#define IFX_PMS_PMSWSTAT2_BLNKFIL_OFF (20u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKEN */
#define IFX_PMS_PMSWSTAT2_ESR0WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKEN */
#define IFX_PMS_PMSWSTAT2_ESR0WKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKEN */
#define IFX_PMS_PMSWSTAT2_ESR0WKEN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKEN */
#define IFX_PMS_PMSWSTAT2_ESR1WKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKEN */
#define IFX_PMS_PMSWSTAT2_ESR1WKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKEN */
#define IFX_PMS_PMSWSTAT2_ESR1WKEN_OFF (25u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINAWKEN */
#define IFX_PMS_PMSWSTAT2_PINAWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINAWKEN */
#define IFX_PMS_PMSWSTAT2_PINAWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINAWKEN */
#define IFX_PMS_PMSWSTAT2_PINAWKEN_OFF (26u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINBWKEN */
#define IFX_PMS_PMSWSTAT2_PINBWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINBWKEN */
#define IFX_PMS_PMSWSTAT2_PINBWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINBWKEN */
#define IFX_PMS_PMSWSTAT2_PINBWKEN_OFF (27u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PWRWKEN */
#define IFX_PMS_PMSWSTAT2_PWRWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PWRWKEN */
#define IFX_PMS_PMSWSTAT2_PWRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PWRWKEN */
#define IFX_PMS_PMSWSTAT2_PWRWKEN_OFF (28u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.SCRWKEN */
#define IFX_PMS_PMSWSTAT2_SCRWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.SCRWKEN */
#define IFX_PMS_PMSWSTAT2_SCRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.SCRWKEN */
#define IFX_PMS_PMSWSTAT2_SCRWKEN_OFF (29u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKEN */
#define IFX_PMS_PMSWSTAT2_PORSTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKEN */
#define IFX_PMS_PMSWSTAT2_PORSTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKEN */
#define IFX_PMS_PMSWSTAT2_PORSTWKEN_OFF (30u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.WUTWKEN */
#define IFX_PMS_PMSWSTAT2_WUTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.WUTWKEN */
#define IFX_PMS_PMSWSTAT2_WUTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.WUTWKEN */
#define IFX_PMS_PMSWSTAT2_WUTWKEN_OFF (31u)

/** \brief Length for Ifx_PMS_PMSWUTCNT_Bits.WUTCNT */
#define IFX_PMS_PMSWUTCNT_WUTCNT_LEN (24u)

/** \brief Mask for Ifx_PMS_PMSWUTCNT_Bits.WUTCNT */
#define IFX_PMS_PMSWUTCNT_WUTCNT_MSK (0xffffffu)

/** \brief Offset for Ifx_PMS_PMSWUTCNT_Bits.WUTCNT */
#define IFX_PMS_PMSWUTCNT_WUTCNT_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR0WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0WKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR0WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0WKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR0WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0WKPCLR_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1WKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1WKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1WKPCLR_OFF (1u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINAWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINAWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINAWKPCLR_OFF (2u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINBWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINBWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINBWKPCLR_OFF (3u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PWRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PWRWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PWRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PWRWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PWRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PWRWKPCLR_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.SCRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_SCRWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.SCRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_SCRWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.SCRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_SCRWKPCLR_OFF (5u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PORSTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PORSTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PORSTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTWKPCLR_OFF (6u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.WUTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_WUTWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.WUTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_WUTWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.WUTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_WUTWKPCLR_OFF (7u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR0OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0OVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR0OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0OVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR0OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0OVRUNCLR_OFF (8u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1OVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1OVRUNCLR_MSK (0x1u)

